# PointSpringCoefficient Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..PointSpringCoefficient Property
SpecTypeId Class See Also
---
Point Spring Coefficient, in discipline Structural.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId PointSpringCoefficient { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PointSpringCoefficient As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PointSpringCoefficient {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace